Service - Income Tax/archive/2021/sample messages/ErrorCode2228.txt

Error code 2228
Request:
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r3:fileRequest xmlns:r3="urn:www.ird.govt.nz/GWS:types/ReturnIR3.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">132306907</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2021-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>3</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r3:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1">
                                <r3:ir215Attached>false</r3:ir215Attached>
                                <r3:totalFTCFromWINZ>0</r3:totalFTCFromWINZ>
                                <r3:totalPAYEDeducted>0</r3:totalPAYEDeducted>
                                <r3:totalGrossIncome>0</r3:totalGrossIncome>
                                <r3:totalIncomeNotLiableForACCLevy>0</r3:totalIncomeNotLiableForACCLevy>
                                <r3:totalTCPDs>0</r3:totalTCPDs>
                                <r3:totalExtinguishedTCPDs>0</r3:totalExtinguishedTCPDs>
                                <r3:totalTaxDeducted>1922.00</r3:totalTaxDeducted>
                                <r3:taxDeductedFromSchedularPayments>0</r3:taxDeductedFromSchedularPayments>
                                <r3:grossSchedularPayments>0</r3:grossSchedularPayments>
                                <r3:schedularExpenses>0</r3:schedularExpenses>
                                <r3:netSchedularPayments>0</r3:netSchedularPayments>
                                <r3:interestIncome>
                                    <ic:totalTaxPaid>0</ic:totalTaxPaid>
                                    <ic:totalIncome>0</ic:totalIncome>
                                </r3:interestIncome>
                                <r3:interestFromPShipEstTrustOrLTC>false</r3:interestFromPShipEstTrustOrLTC>
                                <r3:dividendIncome>
                                    <ic:totalImputationCredits>0</ic:totalImputationCredits>
                                    <ic:totalRWTCredits>0</ic:totalRWTCredits>
                                    <ic:totalGrossDividends>0</ic:totalGrossDividends>
                                </r3:dividendIncome>
                                <r3:dividendsFromPShipEstTrustOrLTC>false</r3:dividendsFromPShipEstTrustOrLTC>
                                <r3:maoriAuthorityDistributions>
                                    <ic:totalMACredits>0</ic:totalMACredits>
                                    <ic:totalMADistributions>0</ic:totalMADistributions>
                                </r3:maoriAuthorityDistributions>
                                <r3:totalTaxPaidByTrustees>0</r3:totalTaxPaidByTrustees>
                                <r3:totalEstateOrTrustIncome>0</r3:totalEstateOrTrustIncome>
                                <r3:totalTaxableDistributionFromNCTrusts>0</r3:totalTaxableDistributionFromNCTrusts>
                                <r3:overseasIncome>
                                    <ic:totalTaxPaid>0</ic:totalTaxPaid>
                                    <ic:totalIncome>0</ic:totalIncome>
                                </r3:overseasIncome>
                                <r3:overseasSuperLumpSums>false</r3:overseasSuperLumpSums>
                                <r3:pieIncome>
                                    <ic:totalTaxCredits>0</ic:totalTaxCredits>
                                    <ic:totalIncome>0</ic:totalIncome>
                                </r3:pieIncome>
                                <r3:partnershipIncome>
                                    <ic:totalTaxCredits>0</ic:totalTaxCredits>
                                    <ic:totalIncome>0</ic:totalIncome>
                                </r3:partnershipIncome>
                                <r3:ltcIncome>
                                    <ic:totalTaxCredits>2000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>2000.00</ic:totalIncome>
                                </r3:ltcIncome>
                                <r3:ltcNonAllowableDeductions>0</r3:ltcNonAllowableDeductions>
                                <r3:ltcPriorYearNonAllowableDeductionsClaimed>0</r3:ltcPriorYearNonAllowableDeductionsClaimed>
                                <r3:ltcAdjustedIncome>2000.00</r3:ltcAdjustedIncome>
                                <r3:governmentSubsidies>0</r3:governmentSubsidies>
                                <r3:taxCreditSubtotal>3922.00</r3:taxCreditSubtotal>
                                <r3:totalShareholderEmployeeSalary>0</r3:totalShareholderEmployeeSalary>
                                <r3:futureShareholderSalary>true</r3:futureShareholderSalary>
                                <r3:shareholderAIMTaxPaid>0</r3:shareholderAIMTaxPaid>
                                <r3:residentialRentalIncome>
                                    <ic:indicator>I</ic:indicator>
                                    <ic:totalIncome>2100.00</ic:totalIncome>
                                    <ic:residentialRentalDeductions>1000.00</ic:residentialRentalDeductions>
                                    <ic:excessDeductionsBroughtForward>0.00</ic:excessDeductionsBroughtForward>
                                    <ic:deductionsClaimedThisYear>1000.00</ic:deductionsClaimedThisYear>
                                    <ic:netIncome>1100.00</ic:netIncome>
                                    <ic:excessDeductionsCarriedForward>0.00</ic:excessDeductionsCarriedForward>
                                </r3:residentialRentalIncome>
                                <r3:netRentalIncome>0</r3:netRentalIncome>
                                <r3:selfEmployedIncome>-56711</r3:selfEmployedIncome>
                                <r3:otherIncome>0</r3:otherIncome>
                                <r3:rlwtCredit>0</r3:rlwtCredit>
                                <r3:saleOfProperty>0</r3:saleOfProperty>
                                <r3:otherExpenses>0</r3:otherExpenses>
                                <r3:lossesBroughtForward>0</r3:lossesBroughtForward>
                                <r3:lossesClaimedThisYear>0</r3:lossesClaimedThisYear>
                                <r3:lossCarriedBackPriorYear>50000</r3:lossCarriedBackPriorYear>
                                <r3:totalTaxableIncome>-55721</r3:totalTaxableIncome>
                                <r3:eligibleForIETC>false</r3:eligibleForIETC>
                                <r3:overseasExclusionDates>
                                    <ic:exclusionDateRange>
                                        <ic:excludedOverseasIncomeStartDate>2015-01-01</ic:excludedOverseasIncomeStartDate>
                                        <ic:excludedOverseasIncomeEndDate>2016-01-01</ic:excludedOverseasIncomeEndDate>
                                    </ic:exclusionDateRange>
                                </r3:overseasExclusionDates>
                                <r3:numberOfQualifyingMonths>0</r3:numberOfQualifyingMonths>
                                <r3:amountOfIETCClaimed>0</r3:amountOfIETCClaimed>
                                <r3:imputationBroughtForward>0</r3:imputationBroughtForward>
                                <r3:taxOnTaxableIncome>850.50</r3:taxOnTaxableIncome>
                                <r3:researchAndDevelopment>
                                    <ic:creditBroughtForward>0</ic:creditBroughtForward>
                                    <ic:nonrefundableCredit>0</ic:nonrefundableCredit>
                                    <ic:refundableCredit>0</ic:refundableCredit>
                                </r3:researchAndDevelopment>
                                <r3:residualIncomeTax>-3149.50</r3:residualIncomeTax>
                                <r3:earlyPaymentDiscountEligibility>false</r3:earlyPaymentDiscountEligibility>
                                <r3:overpaymentProvisionalTax>0</r3:overpaymentProvisionalTax>
                                <r3:provisionalTax>
                                    <ic:provisionalTaxOption>STD</ic:provisionalTaxOption>
                                    <ic:provisionalTaxPayable>100</ic:provisionalTaxPayable>
                                    <ic:provisionalTaxStartDate>2016-01-01</ic:provisionalTaxStartDate>
                                </r3:provisionalTax>
                                <r3:foreignInterestDisclosure>false</r3:foreignInterestDisclosure>
                                <r3:partYearReturnIndicator>true</r3:partYearReturnIndicator>
                                <r3:partYearReason>ARRIVE</r3:partYearReason>
                                <r3:partYearStartDate>2020-08-01</r3:partYearStartDate>
                                <r3:partYearEndDate>2020-12-31</r3:partYearEndDate>
                            </rc:formFields>
                        </rc:fileBody>
                    </r3:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>

Response:
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
    <s:Header>
        <a:Action s:mustUnderstand="1">https://services.ird.govt.nz/GWS/Returns/Return/FileResponse</a:Action>
    </s:Header>
    <s:Body>
        <FileResponse xmlns="https://services.ird.govt.nz/GWS/Returns/">
            <FileResult xmlns:b="https://services.ird.govt.nz/GWS/Returns/:types/FileResponse" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                <b:FileResponseWrapper>
                    <fileResponse xmlns="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <statusMessage xmlns="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <statusCode>2228</statusCode>
                            <errorMessage>lossCarriedBackPriorYear must be 0 when there is no LCB indicator on the previous income tax period</errorMessage>
                        </statusMessage>
                    </fileResponse>
                </b:FileResponseWrapper>
            </FileResult>
        </FileResponse>
    </s:Body>
</s:Envelope>
